In [16]:
import pandas as pd
import sqlite3

In [17]:
df = pd.read_csv("retail_sales_dataset.csv")

In [18]:
conn = sqlite3.connect("retail.db")
cursor = conn.cursor()
df.to_sql("retail", conn, if_exists="replace", index=False)

1000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [20]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [22]:
pd.read_sql("""
SELECT * FROM retail
LIMIT 5
""", conn)

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [70]:
demographic_revenue = pd.read_sql("""
SELECT
CASE
WHEN age >= 18 AND age <= 24 THEN "18-24"
WHEN age >= 25 AND age <= 34 THEN "25-34"
WHEN age >= 35 AND age <= 44 THEN "35-44"
WHEN age >= 45 AND age <= 54 THEN "45-54"
ELSE "55-64"
END AS "Age Category",
Gender,
"Product Category",
SUM("Total Amount") AS "Total Amount",
SUM(Quantity) AS Quantity,
AVG("Price per Unit") AS "Avg Price per Unit"
FROM retail
GROUP BY "Age Category", Gender, "Product Category"
""", conn)

demographic_revenue.to_csv("demographic_revenue.csv", index=False)